loading annotations into memory...
Done (t=0.01s)
creating index...
index created!
loading annotations into memory...
Done (t=0.00s)
creating index...
index created!
Model: "model_1"
________________________________________________________________________________________________________________________________________________________________________________________________________
 Layer (type)                                                     Output Shape                                Param #                 Connected to                                                      
========================================================================================================================================================================================================
 input_2 (InputLayer)                                             [(3, 512, 512, 3)]                          0                       []                                                                
                                                                                                                                                                                                        
 model (Functional)                                               [(3, 128, 128, 3, 8),                       27085184                ['input_2[0][0]']                                                 
                                                                   (3, 64, 64, 3, 8),                                                                                                                   
                                                                   (3, 32, 32, 3, 8),                                                                                                                   
                                                                   (3, 16, 16, 3, 8)]                                                                                                                   
                                                                                                                                                                                                        
 yolo_head (YoloHead)                                             [(3, 128, 128, 3, 8),                       0                       ['model[0][0]',                                                   
                                                                   (3, 64, 64, 3, 8),                                                  'model[0][1]',                                                   
                                                                   (3, 32, 32, 3, 8),                                                  'model[0][2]',                                                   
                                                                   (3, 16, 16, 3, 8)]                                                  'model[0][3]']                                                   
                                                                                                                                                                                                        
========================================================================================================================================================================================================
Total params: 27,085,184
Trainable params: 27,061,696
Non-trainable params: 23,488
________________________________________________________________________________________________________________________________________________________________________________________________________
